#### 📖 Terraform Plan ('src/domains/bonus/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_role_assignment.blob_data_owner_gwc_01 will be destroyed
  # (because azurerm_role_assignment.blob_data_owner_gwc_01 is not in configuration)
  - resource "azurerm_role_assignment" "blob_data_owner_gwc_01" {
      - id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopgwcbonusbackupst01/providers/Microsoft.Authorization/roleAssignments/8aed5e73-a5bb-8915-54f7-9f5846006c6e" -> null
      - name                                   = "8aed5e73-a5bb-8915-54f7-9f5846006c6e" -> null
      - principal_id                           = "0f0aa158-b7ad-4cac-af02-82c3e4768ee6" -> null
      - principal_type                         = "Group" -> null
      - role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/b7e6dc6d-f1e8-4753-8033-0f276bb0955b" -> null
      - role_definition_name                   = "Storage Blob Data Owner" -> null
      - scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopgwcbonusbackupst01" -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_role_assignment.blob_data_owner_itn_01 will be destroyed
  # (because azurerm_role_assignment.blob_data_owner_itn_01 is not in configuration)
  - resource "azurerm_role_assignment" "blob_data_owner_itn_01" {
      - id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnbonusbackupst01/providers/Microsoft.Authorization/roleAssignments/4d005138-95e7-4ff8-f0ac-8b31f637f714" -> null
      - name                                   = "4d005138-95e7-4ff8-f0ac-8b31f637f714" -> null
      - principal_id                           = "0f0aa158-b7ad-4cac-af02-82c3e4768ee6" -> null
      - principal_type                         = "Group" -> null
      - role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/b7e6dc6d-f1e8-4753-8033-0f276bb0955b" -> null
      - role_definition_name                   = "Storage Blob Data Owner" -> null
      - scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnbonusbackupst01" -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_role_assignment.queue_data_contributor_gwc_01 will be destroyed
  # (because azurerm_role_assignment.queue_data_contributor_gwc_01 is not in configuration)
  - resource "azurerm_role_assignment" "queue_data_contributor_gwc_01" {
      - id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopgwcbonusbackupst01/providers/Microsoft.Authorization/roleAssignments/ab7b1559-11ba-d978-90c1-7653f6ba3dda" -> null
      - name                                   = "ab7b1559-11ba-d978-90c1-7653f6ba3dda" -> null
      - principal_id                           = "0f0aa158-b7ad-4cac-af02-82c3e4768ee6" -> null
      - principal_type                         = "Group" -> null
      - role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/974c5e8b-45b9-4653-ba55-5f855dd0fb88" -> null
      - role_definition_name                   = "Storage Queue Data Contributor" -> null
      - scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopgwcbonusbackupst01" -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_role_assignment.queue_data_contributor_itn_01 will be destroyed
  # (because azurerm_role_assignment.queue_data_contributor_itn_01 is not in configuration)
  - resource "azurerm_role_assignment" "queue_data_contributor_itn_01" {
      - id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnbonusbackupst01/providers/Microsoft.Authorization/roleAssignments/f8279497-bb12-8669-6032-b7c49facc622" -> null
      - name                                   = "f8279497-bb12-8669-6032-b7c49facc622" -> null
      - principal_id                           = "0f0aa158-b7ad-4cac-af02-82c3e4768ee6" -> null
      - principal_type                         = "Group" -> null
      - role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/974c5e8b-45b9-4653-ba55-5f855dd0fb88" -> null
      - role_definition_name                   = "Storage Queue Data Contributor" -> null
      - scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnbonusbackupst01" -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_role_assignment.table_data_contributor_gwc_01 will be destroyed
  # (because azurerm_role_assignment.table_data_contributor_gwc_01 is not in configuration)
  - resource "azurerm_role_assignment" "table_data_contributor_gwc_01" {
      - id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopgwcbonusbackupst01/providers/Microsoft.Authorization/roleAssignments/7dbef6b6-9060-081f-d72c-973795a3d946" -> null
      - name                                   = "7dbef6b6-9060-081f-d72c-973795a3d946" -> null
      - principal_id                           = "0f0aa158-b7ad-4cac-af02-82c3e4768ee6" -> null
      - principal_type                         = "Group" -> null
      - role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/0a9a7e1f-b9d0-4cc4-a60d-0319b160aaa3" -> null
      - role_definition_name                   = "Storage Table Data Contributor" -> null
      - scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopgwcbonusbackupst01" -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_role_assignment.table_data_contributor_itn_01 will be destroyed
  # (because azurerm_role_assignment.table_data_contributor_itn_01 is not in configuration)
  - resource "azurerm_role_assignment" "table_data_contributor_itn_01" {
      - id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnbonusbackupst01/providers/Microsoft.Authorization/roleAssignments/62c392d9-c3bd-9e10-1729-3e3e6cbdbf11" -> null
      - name                                   = "62c392d9-c3bd-9e10-1729-3e3e6cbdbf11" -> null
      - principal_id                           = "0f0aa158-b7ad-4cac-af02-82c3e4768ee6" -> null
      - principal_type                         = "Group" -> null
      - role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/0a9a7e1f-b9d0-4cc4-a60d-0319b160aaa3" -> null
      - role_definition_name                   = "Storage Table Data Contributor" -> null
      - scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnbonusbackupst01" -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_storage_account.bonus_backup_gwc_01 must be replaced
-/+ resource "azurerm_storage_account" "bonus_backup_gwc_01" {
      ~ account_replication_type           = "LRS" -> "ZRS" # forces replacement
      ~ allow_nested_items_to_be_public    = false -> true
      - allowed_copy_scope                 = "AAD" -> null
      ~ id                                 = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopgwcbonusbackupst01" -> (known after apply)
      ~ large_file_share_enabled           = false -> (known after apply)
        name                               = "iopgwcbonusbackupst01"
      ~ primary_access_key                 = (sensitive value)
      ~ primary_blob_connection_string     = (sensitive value)
      ~ primary_blob_endpoint              = "https://iopgwcbonusbackupst01.blob.core.windows.net/" -> (known after apply)
      ~ primary_blob_host                  = "iopgwcbonusbackupst01.blob.core.windows.net" -> (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      ~ primary_connection_string          = (sensitive value)
      ~ primary_dfs_endpoint               = "https://iopgwcbonusbackupst01.dfs.core.windows.net/" -> (known after apply)
      ~ primary_dfs_host                   = "iopgwcbonusbackupst01.dfs.core.windows.net" -> (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      ~ primary_file_endpoint              = "https://iopgwcbonusbackupst01.file.core.windows.net/" -> (known after apply)
      ~ primary_file_host                  = "iopgwcbonusbackupst01.file.core.windows.net" -> (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      ~ primary_location                   = "germanywestcentral" -> (known after apply)
      ~ primary_queue_endpoint             = "https://iopgwcbonusbackupst01.queue.core.windows.net/" -> (known after apply)
      ~ primary_queue_host                 = "iopgwcbonusbackupst01.queue.core.windows.net" -> (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      ~ primary_table_endpoint             = "https://iopgwcbonusbackupst01.table.core.windows.net/" -> (known after apply)
      ~ primary_table_host                 = "iopgwcbonusbackupst01.table.core.windows.net" -> (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      ~ primary_web_endpoint               = "https://iopgwcbonusbackupst01.z1.web.core.windows.net/" -> (known after apply)
      ~ primary_web_host                   = "iopgwcbonusbackupst01.z1.web.core.windows.net" -> (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      ~ secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      ~ secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
        tags                               = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Bonus & Pagamenti"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/bonus/prod"
        }
        # (20 unchanged attributes hidden)

      ~ blob_properties {
          - change_feed_retention_in_days = 0 -> null
          + default_service_version       = (known after apply)
            # (3 unchanged attributes hidden)

            # (3 unchanged blocks hidden)
        }

      ~ network_rules (known after apply)
      - network_rules {
          - bypass                     = [
              - "AzureServices",
              - "Logging",
              - "Metrics",
            ] -> null
          - default_action             = "Allow" -> null
          - ip_rules                   = [
              - "81.56.213.143",
            ] -> null
          - virtual_network_subnet_ids = [] -> null
        }

      ~ queue_properties (known after apply)
      - queue_properties {
          - hour_metrics {
              - enabled               = true -> null
              - include_apis          = true -> null
              - retention_policy_days = 7 -> null
              - version               = "1.0" -> null
            }
          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }
          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      ~ routing (known after apply)

      ~ share_properties (known after apply)
      - share_properties {
          - retention_policy {
              - days = 7 -> null
            }
        }

      ~ static_website (known after apply)
    }

  # azurerm_storage_account.bonus_backup_itn_01 will be updated in-place
  ~ resource "azurerm_storage_account" "bonus_backup_itn_01" {
        id                                 = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnbonusbackupst01"
        name                               = "iopitnbonusbackupst01"
      ~ shared_access_key_enabled          = true -> false
        tags                               = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Bonus & Pagamenti"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/bonus/prod"
        }
        # (95 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # azurerm_storage_container.bonus_activations_gwc_01 will be created
  + resource "azurerm_storage_container" "bonus_activations_gwc_01" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "bonus-activations"
      + resource_manager_id               = (known after apply)
      + storage_account_id                = (known after apply)
    }

  # azurerm_storage_container.bonus_activations_itn_01 will be created
  + resource "azurerm_storage_container" "bonus_activations_itn_01" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "bonus-activations"
      + resource_manager_id               = (known after apply)
      + storage_account_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnbonusbackupst01"
    }

  # azurerm_storage_container.bonus_gwc_01 must be replaced
-/+ resource "azurerm_storage_container" "bonus_gwc_01" {
      ~ default_encryption_scope          = "$account-encryption-key" -> (known after apply)
      ~ has_immutability_policy           = false -> (known after apply)
      ~ has_legal_hold                    = false -> (known after apply)
      ~ id                                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopgwcbonusbackupst01/blobServices/default/containers/bonus" -> (known after apply)
      ~ metadata                          = {} -> (known after apply)
        name                              = "bonus"
      ~ resource_manager_id               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopgwcbonusbackupst01/blobServices/default/containers/bonus" -> (known after apply)
      ~ storage_account_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopgwcbonusbackupst01" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # azurerm_storage_container.bonus_leases_gwc_01 will be created
  + resource "azurerm_storage_container" "bonus_leases_gwc_01" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "bonus-leases"
      + resource_manager_id               = (known after apply)
      + storage_account_id                = (known after apply)
    }

  # azurerm_storage_container.bonus_leases_itn_01 will be created
  + resource "azurerm_storage_container" "bonus_leases_itn_01" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "bonus-leases"
      + resource_manager_id               = (known after apply)
      + storage_account_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnbonusbackupst01"
    }

  # azurerm_storage_container.bonus_processing_gwc_01 will be created
  + resource "azurerm_storage_container" "bonus_processing_gwc_01" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "bonus-processing"
      + resource_manager_id               = (known after apply)
      + storage_account_id                = (known after apply)
    }

  # azurerm_storage_container.bonus_processing_itn_01 will be created
  + resource "azurerm_storage_container" "bonus_processing_itn_01" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "bonus-processing"
      + resource_manager_id               = (known after apply)
      + storage_account_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnbonusbackupst01"
    }

  # azurerm_storage_container.change_feed_leases_gwc_01 will be created
  + resource "azurerm_storage_container" "change_feed_leases_gwc_01" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "change-feed-leases"
      + resource_manager_id               = (known after apply)
      + storage_account_id                = (known after apply)
    }

  # azurerm_storage_container.change_feed_leases_itn_01 will be created
  + resource "azurerm_storage_container" "change_feed_leases_itn_01" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "change-feed-leases"
      + resource_manager_id               = (known after apply)
      + storage_account_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnbonusbackupst01"
    }

  # azurerm_storage_container.cosmosdb_gwc_01 will be destroyed
  # (because azurerm_storage_container.cosmosdb_gwc_01 is not in configuration)
  - resource "azurerm_storage_container" "cosmosdb_gwc_01" {
      - container_access_type             = "private" -> null
      - default_encryption_scope          = "$account-encryption-key" -> null
      - encryption_scope_override_enabled = true -> null
      - has_immutability_policy           = false -> null
      - has_legal_hold                    = false -> null
      - id                                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopgwcbonusbackupst01/blobServices/default/containers/cosmosdb" -> null
      - metadata                          = {} -> null
      - name                              = "cosmosdb" -> null
      - resource_manager_id               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopgwcbonusbackupst01/blobServices/default/containers/cosmosdb" -> null
      - storage_account_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopgwcbonusbackupst01" -> null
    }

  # azurerm_storage_container.cosmosdb_itn_01 will be destroyed
  # (because azurerm_storage_container.cosmosdb_itn_01 is not in configuration)
  - resource "azurerm_storage_container" "cosmosdb_itn_01" {
      - container_access_type             = "private" -> null
      - default_encryption_scope          = "$account-encryption-key" -> null
      - encryption_scope_override_enabled = true -> null
      - has_immutability_policy           = false -> null
      - has_legal_hold                    = false -> null
      - id                                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnbonusbackupst01/blobServices/default/containers/cosmosdb" -> null
      - metadata                          = {} -> null
      - name                              = "cosmosdb" -> null
      - resource_manager_id               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnbonusbackupst01/blobServices/default/containers/cosmosdb" -> null
      - storage_account_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnbonusbackupst01" -> null
    }

  # azurerm_storage_container.eligibility_checks_gwc_01 will be created
  + resource "azurerm_storage_container" "eligibility_checks_gwc_01" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "eligibility-checks"
      + resource_manager_id               = (known after apply)
      + storage_account_id                = (known after apply)
    }

  # azurerm_storage_container.eligibility_checks_itn_01 will be created
  + resource "azurerm_storage_container" "eligibility_checks_itn_01" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "eligibility-checks"
      + resource_manager_id               = (known after apply)
      + storage_account_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnbonusbackupst01"
    }

  # azurerm_storage_container.redeemed_requests_gwc_01 must be replaced
-/+ resource "azurerm_storage_container" "redeemed_requests_gwc_01" {
      ~ default_encryption_scope          = "$account-encryption-key" -> (known after apply)
      ~ has_immutability_policy           = false -> (known after apply)
      ~ has_legal_hold                    = false -> (known after apply)
      ~ id                                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopgwcbonusbackupst01/blobServices/default/containers/redeemed-requests" -> (known after apply)
      ~ metadata                          = {} -> (known after apply)
        name                              = "redeemed-requests"
      ~ resource_manager_id               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopgwcbonusbackupst01/blobServices/default/containers/redeemed-requests" -> (known after apply)
      ~ storage_account_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopgwcbonusbackupst01" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # azurerm_storage_container.user_bonuses_gwc_01 will be created
  + resource "azurerm_storage_container" "user_bonuses_gwc_01" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "user-bonuses"
      + resource_manager_id               = (known after apply)
      + storage_account_id                = (known after apply)
    }

  # azurerm_storage_container.user_bonuses_itn_01 will be created
  + resource "azurerm_storage_container" "user_bonuses_itn_01" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "user-bonuses"
      + resource_manager_id               = (known after apply)
      + storage_account_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnbonusbackupst01"
    }

  # azurerm_storage_object_replication.itn_01_to_gwc_01 must be replaced
-/+ resource "azurerm_storage_object_replication" "itn_01_to_gwc_01" {
      ~ destination_object_replication_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopgwcbonusbackupst01/objectReplicationPolicies/abe43c72-9bf2-4f56-a1c8-455188c334a2" -> (known after apply)
      ~ destination_storage_account_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopgwcbonusbackupst01" -> (known after apply) # forces replacement
      ~ id                                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnbonusbackupst01/objectReplicationPolicies/abe43c72-9bf2-4f56-a1c8-455188c334a2;/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopgwcbonusbackupst01/objectReplicationPolicies/abe43c72-9bf2-4f56-a1c8-455188c334a2" -> (known after apply)
      ~ source_object_replication_id      = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnbonusbackupst01/objectReplicationPolicies/abe43c72-9bf2-4f56-a1c8-455188c334a2" -> (known after apply)
        # (1 unchanged attribute hidden)

      - rules {
          - copy_blobs_created_after     = "Everything" -> null
          - destination_container_name   = "bonus" -> null
          - filter_out_blobs_with_prefix = [] -> null
          - name                         = "4ce5235d-249c-4273-9229-d4f8b08f249b" -> null
          - source_container_name        = "bonus" -> null
        }
      - rules {
          - copy_blobs_created_after     = "Everything" -> null
          - destination_container_name   = "cosmosdb" -> null
          - filter_out_blobs_with_prefix = [] -> null
          - name                         = "834808b3-dde0-482a-ade0-3aedbb7d3f99" -> null
          - source_container_name        = "cosmosdb" -> null
        }
      - rules {
          - copy_blobs_created_after     = "Everything" -> null
          - destination_container_name   = "redeemed-requests" -> null
          - filter_out_blobs_with_prefix = [] -> null
          - name                         = "fe5953dc-0bdc-4ff2-8baf-b7bf2728c7e8" -> null
          - source_container_name        = "redeemed-requests" -> null
        }
      + rules {
          + copy_blobs_created_after     = "Everything"
          + destination_container_name   = "bonus"
          + filter_out_blobs_with_prefix = []
          + name                         = (known after apply)
          + source_container_name        = "bonus"
        }
      + rules {
          + copy_blobs_created_after     = "Everything"
          + destination_container_name   = "bonus-activations"
          + filter_out_blobs_with_prefix = []
          + name                         = (known after apply)
          + source_container_name        = "bonus-activations"
        }
      + rules {
          + copy_blobs_created_after     = "Everything"
          + destination_container_name   = "bonus-leases"
          + filter_out_blobs_with_prefix = []
          + name                         = (known after apply)
          + source_container_name        = "bonus-leases"
        }
      + rules {
          + copy_blobs_created_after     = "Everything"
          + destination_container_name   = "bonus-processing"
          + filter_out_blobs_with_prefix = []
          + name                         = (known after apply)
          + source_container_name        = "bonus-processing"
        }
      + rules {
          + copy_blobs_created_after     = "Everything"
          + destination_container_name   = "change-feed-leases"
          + filter_out_blobs_with_prefix = []
          + name                         = (known after apply)
          + source_container_name        = "change-feed-leases"
        }
      + rules {
          + copy_blobs_created_after     = "Everything"
          + destination_container_name   = "eligibility-checks"
          + filter_out_blobs_with_prefix = []
          + name                         = (known after apply)
          + source_container_name        = "eligibility-checks"
        }
      + rules {
          + copy_blobs_created_after     = "Everything"
          + destination_container_name   = "redeemed-requests"
          + filter_out_blobs_with_prefix = []
          + name                         = (known after apply)
          + source_container_name        = "redeemed-requests"
        }
      + rules {
          + copy_blobs_created_after     = "Everything"
          + destination_container_name   = "user-bonuses"
          + filter_out_blobs_with_prefix = []
          + name                         = (known after apply)
          + source_container_name        = "user-bonuses"
        }
    }

  # azurerm_storage_table.adelogs will be destroyed
  # (because azurerm_storage_table.adelogs is not in configuration)
  - resource "azurerm_storage_table" "adelogs" {
      - id                   = "https://iopitnbonusbackupst01.table.core.windows.net/Tables('adelogs')" -> null
      - name                 = "adelogs" -> null
      - storage_account_name = "iopitnbonusbackupst01" -> null
    }

  # azurerm_storage_table.bonusleasebindings will be destroyed
  # (because azurerm_storage_table.bonusleasebindings is not in configuration)
  - resource "azurerm_storage_table" "bonusleasebindings" {
      - id                   = "https://iopitnbonusbackupst01.table.core.windows.net/Tables('bonusleasebindings')" -> null
      - name                 = "bonusleasebindings" -> null
      - storage_account_name = "iopitnbonusbackupst01" -> null
    }

  # azurerm_storage_table.eligibilitychecks will be destroyed
  # (because azurerm_storage_table.eligibilitychecks is not in configuration)
  - resource "azurerm_storage_table" "eligibilitychecks" {
      - id                   = "https://iopitnbonusbackupst01.table.core.windows.net/Tables('eligibilitychecks')" -> null
      - name                 = "eligibilitychecks" -> null
      - storage_account_name = "iopitnbonusbackupst01" -> null
    }

  # azurerm_storage_table.inpslogs will be destroyed
  # (because azurerm_storage_table.inpslogs is not in configuration)
  - resource "azurerm_storage_table" "inpslogs" {
      - id                   = "https://iopitnbonusbackupst01.table.core.windows.net/Tables('inpslogs')" -> null
      - name                 = "inpslogs" -> null
      - storage_account_name = "iopitnbonusbackupst01" -> null
    }

  # azurerm_storage_table.opsActiveBonusSentMsgStatus will be destroyed
  # (because azurerm_storage_table.opsActiveBonusSentMsgStatus is not in configuration)
  - resource "azurerm_storage_table" "opsActiveBonusSentMsgStatus" {
      - id                   = "https://iopitnbonusbackupst01.table.core.windows.net/Tables('opsActiveBonusSentMsgStatus')" -> null
      - name                 = "opsActiveBonusSentMsgStatus" -> null
      - storage_account_name = "iopitnbonusbackupst01" -> null
    }

  # azurerm_storage_table.redeemederrors will be destroyed
  # (because azurerm_storage_table.redeemederrors is not in configuration)
  - resource "azurerm_storage_table" "redeemederrors" {
      - id                   = "https://iopitnbonusbackupst01.table.core.windows.net/Tables('redeemederrors')" -> null
      - name                 = "redeemederrors" -> null
      - storage_account_name = "iopitnbonusbackupst01" -> null
    }

Plan: 16 to add, 1 to change, 18 to destroy.

Changes to Outputs:
  ~ storage_account_secondary = {
      ~ id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopgwcbonusbackupst01" -> (known after apply)
        name                = "iopgwcbonusbackupst01"
        # (1 unchanged attribute hidden)
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
